TODO.org

* Сервис по предоставлению процессов населению

** TODO Клиентская часть [0/8]
   - [ ] API для работы с доступными оболочками
   - [ ] web-морда
   - [ ] хранение кода и вызов его из панели пользователя
   - [ ] возможность публикации макросов наружу
   - [ ] возможность приобрести доступ к сети
   - [ ] авторизация по OAuth2
   - [ ] хранилище данных
   - [ ] контроль за ресурсами
   - [ ] биллинг

** TODO Серверная часть [1/7]
   - [X] Запуск trytry без lxc
   - [ ] Запуск lxc
   - [ ] Возможность варьировать время работы контейнера
   - [ ] Сохранение окружения для последующих вызовов
   - [ ] Безопасность контейнеров (есть ли проблема с рутом?)
   - [ ] Упрощение создания новых оболочек
   - [ ] управление ресурсами и слежение за ними (cgroups)
   - [ ] Обсчёт ресурсов
     
** TODO Тестирование [1/7]
   - [X] Запуск тестового сервера на локальной машине
   - [ ] Настройка nginx для работы со статикой
   - [ ] Проработка вопроса автоматического тестирования
   - [ ] Процент покрытия тестами?
   - [ ] Тесты интерфейса
   - [ ] Тесты нагрузок
   - [ ] Тесты безопасности
