TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODO</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="TODO"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-23 18:03:54 YEKT"/>
<meta name="author" content="pimiento"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg-classic.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">TODO</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Сервис по предоставлению процессов населению</a>
<ul>
<li><a href="#sec-1-1">1.1 Клиентская часть [0/8]</a></li>
<li><a href="#sec-1-2">1.2 Серверная часть [1/7]</a></li>
<li><a href="#sec-1-3">1.3 Тестирование [1/7]</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Сервис по предоставлению процессов населению</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Клиентская часть [0/8]</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li><code>[&nbsp;]</code> API для работы с доступными оболочками
</li>
<li><code>[&nbsp;]</code> web-морда
</li>
<li><code>[&nbsp;]</code> хранение кода и вызов его из панели пользователя
</li>
<li><code>[&nbsp;]</code> возможность публикации макросов наружу
</li>
<li><code>[&nbsp;]</code> возможность приобрести доступ к сети
</li>
<li><code>[&nbsp;]</code> авторизация по OAuth2
</li>
<li><code>[&nbsp;]</code> хранилище данных
</li>
<li><code>[&nbsp;]</code> контроль за ресурсами
</li>
<li><code>[&nbsp;]</code> биллинг
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Серверная часть [1/7]</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><code>[X]</code> Запуск trytry без lxc
</li>
<li><code>[&nbsp;]</code> Запуск lxc
</li>
<li><code>[&nbsp;]</code> Возможность варьировать время работы контейнера
</li>
<li><code>[&nbsp;]</code> Сохранение окружения для последующих вызовов
</li>
<li><code>[&nbsp;]</code> Безопасность контейнеров (есть ли проблема с рутом?)
</li>
<li><code>[&nbsp;]</code> Упрощение создания новых оболочек
</li>
<li><code>[&nbsp;]</code> управление ресурсами и слежение за ними (cgroups)
</li>
<li><code>[&nbsp;]</code> Обсчёт ресурсов
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Тестирование [1/7]</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li><code>[X]</code> Запуск тестового сервера на локальной машине
</li>
<li><code>[&nbsp;]</code> Настройка nginx для работы со статикой
</li>
<li><code>[&nbsp;]</code> Проработка вопроса автоматического тестирования
</li>
<li><code>[&nbsp;]</code> Процент покрытия тестами?
</li>
<li><code>[&nbsp;]</code> Тесты интерфейса
</li>
<li><code>[&nbsp;]</code> Тесты нагрузок
</li>
<li><code>[&nbsp;]</code> Тесты безопасности
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-23 18:03:54 YEKT</p>
<p class="author">Author: pimiento</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
